readme.org
* eXtended Contact Mode Score (xCMS)
Extend the application of Contact Mode Score to non-identical complexes

** Methods
1. Contact Matrix
   1. Corresponding residues of two binding pockets
      1. [X] <<<subject>>>
         1. [X] Ligands of two pockets have a Tc >= 0.5
         2. [X] Sequence similarity < 30% between the two associated proteins
         3. [X] shaore >= 50 atmic ligand-protein contacts of same type
         4. [X] the pdb files provided by Apoc contains only C_alpha atoms
   2. [X] coordinates of the effective points
      1. use the pdb files downloaded from PDB to grep the proteins' residues
      2. use the mixed resolution as in the CMS
      3. use the <<<virtual effective>>> points to compensate for miss-matched residues
         1. the contact between a ligand atom and a virtual effective point is always *None*
      4. [X] retrieve the ligand from mmCIF file and convert to mol2 format
         1. [X] can tag such as "3zyc_GCP_A_1749" uniquely identify a ligand from the pdb file?
            Yes, but it is not safe to do so in a pdb file
         2. [X] check out
            1. [X] Python PDBx
            2. [X] BioPython
            3. [X] OpenBabel c++ library
               1. residue names become "LIG" when read by babel
               2. [X] how babel parse the mmCIF file?
                  hacked the parser in babel for mmCIF in ordr to retrieve auth* fields
   3. [ ] certain ligands cannot be grepped
      e.g. 3q2k_NAD_P_500
   4. [ ] certain pdbs miss some atoms
      1. in /ddnB/work/jaydy/dat/pdb/vn/pdb3vn9.ent
         | ATOM | 674 | N  | GLU | A | 130 | -2.316 | -44.226 | 2.992 | 1.00 |  90.63 | N |
         | ATOM | 675 | CA | GLU | A | 130 | -1.581 | -44.192 | 4.257 | 1.00 |  83.49 | C |
         | ATOM | 676 | C  | GLU | A | 130 | -1.888 | -42.913 | 5.017 | 1.00 | 100.53 | C |
         | ATOM | 677 | O  | GLU | A | 130 | -2.031 | -41.844 | 4.392 | 1.00 |  97.24 | O |
         | ATOM | 678 | CB | GLU | A | 130 | -0.072 | -44.310 | 4.027 | 1.00 |  73.44 | C |
      2. in /ddnB/work/jaydy/dat/pdb/t9/pdb3t9a.ent
         | ATOM | 1612 | N   | GLU | A | 238 |  8.315 | -2.250 | 6.872 | 1.00 | 21.85 | N |
         | ATOM | 1613 | CA  | GLU | A | 238 |  9.731 | -2.356 | 7.160 | 1.00 | 23.40 | C |
         | ATOM | 1614 | C   | GLU | A | 238 | 10.257 | -0.984 | 7.551 | 1.00 | 23.08 | C |
         | ATOM | 1615 | O   | GLU | A | 238 |  9.910 |  0.026 | 6.922 | 1.00 | 22.77 | O |
         | ATOM | 1616 | CB  | GLU | A | 238 | 10.506 | -2.904 | 5.947 | 1.00 | 23.90 | C |
         | ATOM | 1617 | CG  | GLU | A | 238 | 10.539 | -1.968 | 4.735 | 1.00 | 27.61 | C |
         | ATOM | 1618 | CD  | GLU | A | 238 | 11.471 | -2.450 | 3.608 | 1.00 | 32.44 | C |
         | ATOM | 1619 | OE1 | GLU | A | 238 | 12.400 | -3.248 | 3.888 | 1.00 | 35.07 | O |
         | ATOM | 1620 | OE2 | GLU | A | 238 | 11.268 | -2.020 | 2.448 | 1.00 | 32.92 | O |
      3. problem resolved if by using virtual effective points
   5. list file from apoc contains weird keys words such as "### XYM 35"
      1. original
         /ddnB/work/jaydy/dat/apoc/RS2.lst
      2. cleaned
         /work/jaydy/dat/apoc/RS2_valid.lst
   6. Corresponding heavy atoms of two ligands
      1. Kcombu (currently used)
      2. SIMCOMP (used in Apoc paper)
         <<<SIMCOMP>>> tend to yield higher Tc than <<<pkcombu>>>

