readme.org
** Pipeline
1. Original pdb file for the complex
   1. apoc_inputs.PdbPathTask
   2. apoc_inputs.DecompressedPdb
2. Grep Ligand atoms from the pdb
   1. apoc_inputs.LigandExpStructureInPdb
3. Run apoc
   1. run_control_apoc.LpcApocResultTask
4. Run kcombu
   1. run_control_apoc.LpcKcombuResult
5. Parsers
   1. run_control_apoc.ApocResultParer
   2. run_control_apoc.PkcombuAtomMatchParser
6. Run xcms
   1. xcms.LpcApocXcms
7. Collect data for analysis
   1. collect_xcms.AtomicXcmsCollection
   2. collect_xcms.AtomicXcmsTable

** [#A] xCms back compatible with Cms
The value of xCms should be <<<back-compatible>>> with Cms.
1. materials
   complexes in the Astext dataset
2. methods
   1. apply rotation and translation to each ligand
      1. to calculate Cms for each complex
         1. calculate the Cms between the variational conformations and the native conformation
      2. to calculate xCms for eac complex
         1. find the neighboring residues in contact with ligand atoms
         2. align the neighboring residues using Apoc
         3. for the matching residues from Apoc, add virtual points
         4. calculate the xCms between the variational conformations and the native conformation

** [#A] Statistical significance of cms
1. run MC for each complex in astex with weak constraints
   1. vdw * 0.5
2. cluster the conformations based on their translational and rotational vector
   1. [X] experiment with DBSCAN
      1. do not use DBSCAN becuase it removes the outliers
   2. [X] experiment with KMeans
      1. Kmeans maintain the density distribution as the original ponts
   3. experiment with the grid method
      1. [X] grid method provides evenly distributed points
      2. [ ] in bining the points, use the median point as the center
         1. Be careful with rotational angles; they *DO NOT* conform to vector calculation
            1. [ ] experiment with not bining the rotational angles
3. calculate pair-wise p-value
4. sample
   1. [X] stratefied sampling
      Assume that the # of grid cells is n,
      the # of samples from each complex is \propto to n^2
5. [ ] dependence on the ligand size and the protein size
6. [ ] analyze the distribution of the cms values


** [#B] Statistical significance of xcms value
*** Run on a random dataset
1. Random set (<<<RS2>>>) from Apoc
   /ddnB/work/jaydy/dat/apoc/RS2.lst
   /ddnB/work/jaydy/dat/apoc/RS2_valid.lst
2. script
   ./src/run_lpc_randomset.py
3. [X] run time errors
   Cannot do much about the errors below because of the in-perfection of the source of data.
   1. missing pdb files
      /ddnB/work/jaydy/dat/apoc/missing_pdbs.txt
   2. protein pairs that have mis-matched elements
      /ddnB/work/jaydy/dat/apoc/mis_matched_prt.txt
   3. kcombu failures
      /ddnB/work/jaydy/dat/apoc/kcombu_failures.txt
4. [ ] curate <<<dataset>>>
   1. [ ] calculate the all-against-all apoc, kcombu using the successful pockets dataset
   2. [ ] cluster using DBSCAN based on the ps-score and Tc between two pockets
      1. \sqrt{ps-score^2 + Tc^2} --> similarity
      2. or use the product directly
      3. similarity(ps-score = 0.4, Tc = 0.4) --> eps
   3. [ ] use the centroids' xcms to calculate the statistical significance
5. curate subject
   ./src/curate.py
   ./src/run_curate.py
   1. dbscan for subject dataset
      |  eps | #clusters |
      |------+-----------|
      |  1.0 |      1070 |
      |  1.1 |       764 |
      | 1.15 |       620 |
      |  1.2 |       406 |
      |  1.3 |       103 |


* DONE Assess AutoVina on DUDE
CLOSED: [2016-02-24 Wed 14:20]

** DONE Presumption
CLOSED: [2016-02-12 Fri 14:39]
Similar ligand and pockets yield high spearmanr between the distance vectors

*** DONE Prove
CLOSED: [2016-02-12 Fri 14:38]
1. [X] Use BioLip's structure to query
2. [X] Cluster the ligands in BioLip
3. [X] do the clustering of the proteins using CD-HIT?
   http://weizhongli-lab.org/cd-hit/
   #+BEGIN_SRC python
     # generate fasta sequence from pdb file
     import pybel
     prt = pybel.readfile('pdb', "/ddnB/work/jaydy/dat/BioLip/prt/01/101mA.pdb").next()
     fasta_str = prt.write('fasta')
   #+END_SRC
     No, because we will rank the templates
4. [X] find how spearmanr evolves with ps_score and TC

** DONE Use mutiple template pockets and ligands
CLOSED: [2016-02-12 Fri 14:39]
1. Non-redundant dataset of proteins and ligands
   http://zhanglab.ccmb.med.umich.edu/BioLiP/download.html
   1. filter the ligands with
      1. size constraints (6 < size)
      2. [X] tanimoto coefficients > 0.5 (using FastSearch in OpenBabel http://openbabel.org/wiki/FastSearch)
         Note that pkcombu and babel gives different tanimoto coefficients for the same ligand pair
   2. [X] Index the ligands
      1. [X] use only small ligands with #atom < 999
      2. [X] /home/jaydy/Workspace/Bitbucket/xcms/src/ligand_nr.bash
      3. [X] /home/jaydy/Workspace/Bitbucket/xcms/src/apc_pbs/wq_ligand_nr.pbs
   3. [X] Index
      #+BEGIN_SRC sh
        cd /ddnB/work/jaydy/dat/BioLip/
        babel ligand_nr.sdf -ofs
        # results are written to /ddnB/work/jaydy/dat/BioLip/ligand_nr.fs
      #+END_SRC
   4. [X] Search
      #+BEGIN_SRC sh
        # example command
        cd /work/jaydy/dat/BioLip
        babel ligand_nr.fs outfile.sdf -s ./sml_ligand_nr/08/208l_CYS_A_1.pdb -at0.5
      #+END_SRC
   5. BioLip-referenced SpearmanR

** DONE Random prediction
CLOSED: [2016-02-24 Wed 14:20]
AutoVina has an option for random prediciton of ligand within the binding site.

** DONE Random v.s. AutoVina Vina using CMS, XCMS and RMSD
CLOSED: [2016-05-05 Thu 16:21]
1. statistics
   | stas  |   rnd_xcms |  pred_xcms |    rnd_rmsd |   pred_rmsd |     rnd_cms |    pred_cms |
   |-------+------------+------------+-------------+-------------+-------------+-------------|
   | count | 699.000000 | 699.000000 | 2200.000000 | 2200.000000 | 2200.000000 | 2200.000000 |
   | mean  |   0.194438 |   0.545467 |    8.025521 |    3.660226 |    0.190847 |    0.547677 |
   | std   |   0.244270 |   0.409696 |    3.422547 |    2.808389 |    0.159145 |    0.272731 |
   | min   |  -0.547524 |  -0.474403 |    1.207914 |    0.176276 |   -0.026508 |   -0.013770 |
   | 25%   |   0.036368 |   0.203030 |    5.494956 |    1.402787 |    0.069933 |    0.308091 |
   | 50%   |   0.197694 |   0.694235 |    7.596452 |    2.889980 |    0.152046 |    0.573644 |
   | 75%   |   0.366260 |   0.912437 |   10.014924 |    5.292552 |    0.279209 |    0.798248 |
   | max   |   0.816259 |   0.993887 |   26.166285 |   17.152016 |    0.876955 |    0.987187 |

* Case studies
1. script
   ./src/superpose.py
2. cases
   | query            | template         | spearmanr |     rmsd | TM-score |      cms |  query EC | template EC |
   |------------------+------------------+-----------+----------+----------+----------+-----------+-------------|
   | 1o8b_ABF_A_1.pdb | 3bxh_F6P_A_1.pdb |  0.756368 | 1.581726 |  0.26849 | 0.774737 |   5.3.1.6 | N/A         |
   | 2yiw_YIW_A_1.pdb | 3f3u_1AW_A_1.pdb |   0.96104 | 0.420666 |  0.75643 | 0.937001 | 2.7.11.24 | 2.7.10.2    |

* DONE CMS v.s. RMSD [3/3]
CLOSED: [2016-08-07 Sun 23:06] DEADLINE: <2016-08-07 Sun>
:LOGBOOK:
CLOCK: [2016-08-07 Sun 22:59]--[2016-08-07 Sun 23:06] =>  0:07
CLOCK: [2016-08-07 Sun 17:25]--[2016-08-07 Sun 17:50] =>  0:25
CLOCK: [2016-08-07 Sun 13:38]--[2016-08-07 Sun 13:49] =>  0:11
:END:
** DONE Generate conformations [4/4]
CLOSED: [2016-08-07 Sun 17:26] SCHEDULED: <2016-08-06 Sat>
1. [X] ./src/gen_vec.py
2. [X] ./src/trace.bash
3. [X] /home/jaydy/Workspace/GitHub/geaxdock_gpu/data/trajectory.sample.out
4. [X] /work/jaydy/working/astex/rnd_confs

** DONE Calculate CMS and RMSD [3/3]
CLOSED: [2016-08-07 Sun 23:06] DEADLINE: <2016-08-07 Sun> SCHEDULED: <2016-08-06 Sat>
:LOGBOOK:
CLOCK: [2016-08-07 Sun 18:41]--[2016-08-07 Sun 19:10] =>  0:29
CLOCK: [2016-08-07 Sun 12:20]--[2016-08-07 Sun 12:31] =>  0:11
CLOCK: [2016-08-07 Sun 01:12]--[2016-08-07 Sun 01:52] =>  0:40
CLOCK: [2016-08-06 Sat 22:41]--[2016-08-06 Sat 23:15] =>  0:34
:END:

