readme.md

## Pipeline<a id="orgheadline2"></a>

1.  Original pdb file for the complex
    1.  apoc\_inputs.PdbPathTask
    2.  apoc\_inputs.DecompressedPdb
2.  Grep Ligand atoms from the pdb
    1.  apoc\_inputs.LigandExpStructureInPdb
3.  Run apoc
    1.  run\_control\_apoc.LpcApocResultTask
4.  Run kcombu
    1.  run\_control\_apoc.LpcKcombuResult
5.  Parsers
    1.  run\_control\_apoc.ApocResultParer
    2.  run\_control\_apoc.PkcombuAtomMatchParser
6.  Run xcms
    1.  xcms.LpcApocXcms
7.  Collect data for analysis
    1.  collect\_xcms.AtomicXcmsCollection
    2.  collect\_xcms.AtomicXcmsTable

## xCms back compatible with Cms<a id="orgheadline3"></a>

The value of xCms should be <a id="orgradiotarget5">back-compatible</a> with Cms.

1.  materials
    complexes in the Astext dataset
2.  methods
    1.  apply rotation and translation to each ligand
        1.  to calculate Cms for each complex
            1.  calculate the Cms between the variational conformations and the native conformation
        2.  to calculate xCms for eac complex
            1.  find the neighboring residues in contact with ligand atoms
            2.  align the neighboring residues using Apoc
            3.  for the matching residues from Apoc, add virtual points
            4.  calculate the xCms between the variational conformations and the native conformation

## Statistical significance of cms<a id="orgheadline4"></a>

1.  run MC for each complex in astex with weak constraints
    1.  vdw \* 0.5
2.  cluster the conformations based on their translational and rotational vector
    1.  [X] experiment with DBSCAN
        1.  do not use DBSCAN becuase it removes the outliers
    2.  [X] experiment with KMeans
        1.  Kmeans maintain the density distribution as the original ponts
    3.  experiment with the grid method
        1.  [X] grid method provides evenly distributed points
        2.  [ ] in bining the points, use the median point as the center
            1.  Be careful with rotational angles; they **DO NOT** conform to vector calculation
                1.  [ ] experiment with not bining the rotational angles
3.  calculate pair-wise p-value
4.  sample
    1.  [X] stratefied sampling
        Assume that the # of grid cells is n,
        the # of samples from each complex is &prop; to n^2
5.  [ ] dependence on the ligand size and the protein size
6.  [ ] analyze the distribution of the cms values

## Statistical significance of xcms value<a id="orgheadline6"></a>

### Run on a random dataset<a id="orgheadline5"></a>

1.  Random set (<a id="orgradiotarget6">RS2</a>) from Apoc
    /ddnB/work/jaydy/dat/apoc/RS2.lst
    /ddnB/work/jaydy/dat/apoc/RS2\_valid.lst
2.  script
    ./src/run\_lpc\_randomset.py
3.  [X] run time errors
    Cannot do much about the errors below because of the in-perfection of the source of data.
    1.  missing pdb files
        /ddnB/work/jaydy/dat/apoc/missing\_pdbs.txt
    2.  protein pairs that have mis-matched elements
        /ddnB/work/jaydy/dat/apoc/mis\_matched\_prt.txt
    3.  kcombu failures
        /ddnB/work/jaydy/dat/apoc/kcombu\_failures.txt
4.  [ ] curate <a id="orgradiotarget7">dataset</a>
    1.  [ ] calculate the all-against-all apoc, kcombu using the successful pockets dataset
    2.  [ ] cluster using DBSCAN based on the ps-score and Tc between two pockets
        1.  \sqrt{ps-score^2 + Tc^2} &#x2013;> similarity
        2.  or use the product directly
        3.  similarity(ps-score = 0.4, Tc = 0.4) &#x2013;> eps
    3.  [ ] use the centroids' xcms to calculate the statistical significance
5.  curate subject
    ./src/curate.py
    ./src/run\_curate.py
    1.  dbscan for subject dataset
        
        <table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
        
        
        <colgroup>
        <col  class="org-right" />
        
        <col  class="org-right" />
        </colgroup>
        <thead>
        <tr>
        <th scope="col" class="org-right">eps</th>
        <th scope="col" class="org-right">#clusters</th>
        </tr>
        </thead>
        
        <tbody>
        <tr>
        <td class="org-right">1.0</td>
        <td class="org-right">1070</td>
        </tr>
        
        
        <tr>
        <td class="org-right">1.1</td>
        <td class="org-right">764</td>
        </tr>
        
        
        <tr>
        <td class="org-right">1.15</td>
        <td class="org-right">620</td>
        </tr>
        
        
        <tr>
        <td class="org-right">1.2</td>
        <td class="org-right">406</td>
        </tr>
        
        
        <tr>
        <td class="org-right">1.3</td>
        <td class="org-right">103</td>
        </tr>
        </tbody>
        </table>

# TODO Assess AutoVina on DUDE<a id="orgheadline12"></a>

## DONE Presumption<a id="orgheadline9"></a>

Similar ligand and pockets yield high spearmanr between the distance vectors

### DONE Prove<a id="orgheadline8"></a>

1.  [X] Use BioLip's structure to query
2.  [X] Cluster the ligands in BioLip
3.  [X] do the clustering of the proteins using CD-HIT?
    <http://weizhongli-lab.org/cd-hit/>
    
    ```python
    # generate fasta sequence from pdb file
    import pybel
    prt = pybel.readfile('pdb', "/ddnB/work/jaydy/dat/BioLip/prt/01/101mA.pdb").next()
    fasta_str = prt.write('fasta')
    ```
    
    No, because we will rank the templates
4.  [X] find how spearmanr evolves with ps\_score and TC

## DONE Use mutiple template pockets and ligands<a id="orgheadline10"></a>

1.  Non-redundant dataset of proteins and ligands
    <http://zhanglab.ccmb.med.umich.edu/BioLiP/download.html>
    1.  filter the ligands with
        1.  size constraints (6 < size)
        2.  [ ] tanimoto coefficients > 0.5 (using FastSearch in OpenBabel <http://openbabel.org/wiki/FastSearch>)
            Note that pkcombu and babel gives different tanimoto coefficients for the same ligand pair
    2.  [X] Index the ligands
        1.  [X] use only small ligands with #atom < 999
        2.  [X] /home/jaydy/Workspace/Bitbucket/xcms/src/ligand\_nr.bash
        3.  [X] /home/jaydy/Workspace/Bitbucket/xcms/src/apc\_pbs/wq\_ligand\_nr.pbs
    3.  [X] Index
        
        ```sh
        cd /ddnB/work/jaydy/dat/BioLip/
        babel ligand_nr.sdf -ofs
        # results are written to /ddnB/work/jaydy/dat/BioLip/ligand_nr.fs
        ```
    4.  [X] Search
        
        ```sh
        # example command
        cd /work/jaydy/dat/BioLip
        babel ligand_nr.fs outfile.sdf -s ./sml_ligand_nr/08/208l_CYS_A_1.pdb -at0.5
        ```
    5.  BioLip-referenced SpearmanR

## TODO Random prediction<a id="orgheadline11"></a>

AutoVina has an option for random prediciton of ligand within the binding site.
